## Numbeo Extract - city_prices

To extract from the API of NUmbeo follow the next steps:
- Access the url prefix with a request method e.g. `https://www.numbeo.com:8008/api/<DOCUMENT>?api_key=<YOUR_KEY>`
- Every document (table) in Numbeo has different parameters to query, for more info go to [API doc](https://www.numbeo.com/api/doc.jsp)

In [1]:
import pandas as pd
import requests
import json
from pandas.io.json import json_normalize

## Cities

**Query parameters:**

Parameter name|Description|Mandatory
---|---|---
api_key|API Key|yes

In [13]:
request_cities = requests.get("http://www.numbeo.com:8008/api/cities?api_key=")

In [14]:
df_cities = json_normalize(json.loads(request_cities.text)['cities'])

In [16]:
df_cities.head()

       city  city_id  country   latitude  longitude
0  Abelessa        1  Algeria  22.187777   4.069545
1     Adrar        2  Algeria  27.875614  -0.290750
2      Aflu        3  Algeria  34.113883   2.097262
3   Algiers        4  Algeria  36.752887   3.042048
4    Annaba        5  Algeria  36.902859   7.755543

## City Prices

Parameter name|Description|Mandatory
---|---|---
api_key|API Key|yes
query|City Name|yes

In [10]:
request = requests.get("http://www.numbeo.com:8008/api/city_prices?api_key=&query=Maastricht")

In [11]:
df = json_normalize(json.loads(request.text)['prices'])
df.head()

,average_price,data_points,highest_price,item_id,item_name,lowest_price
0,12.0,11,15.0,1,"Meal, Inexpensive Restaurant, Restaurants",10.0
1,50.0,10,60.0,2,"Meal for 2 People, Mid-range Restaurant, Three...",45.0
2,7.0,10,8.0,3,McMeal at McDonalds (or Equivalent Combo Meal)...,6.5
3,4.0,9,5.0,4,"Domestic Beer (0.5 liter draught), Restaurants",2.5
4,3.5,9,4.5,5,"Imported Beer (0.33 liter bottle), Restaurants",3.0

In [28]:
request = requests.get("http://www.numbeo.com:8008/api/city_prices?api_key=&query=Maastricht")

In [29]:
df = json_normalize(json.loads(request.text)['prices'])
df.head()

,average_price,data_points,highest_price,item_id,item_name,lowest_price
0,12.0,11,15.0,1,"Meal, Inexpensive Restaurant, Restaurants",10.0
1,50.0,10,60.0,2,"Meal for 2 People, Mid-range Restaurant, Three...",45.0
2,7.0,10,8.0,3,McMeal at McDonalds (or Equivalent Combo Meal)...,6.5
3,4.0,9,5.0,4,"Domestic Beer (0.5 liter draught), Restaurants",2.5
4,3.5,9,4.5,5,"Imported Beer (0.33 liter bottle), Restaurants",3.0

In [47]:
try:
    tuples = []
    for cities in df_cities['city']:
        request = requests.get("http://www.numbeo.com:8008/api/city_prices?api_key=&query="+str(cities))
        table = json_normalize(json.loads(request.text)['prices'])
        tuples.append((cities,table))
    
    tables = {key: value for (key, value) in tuples}
    print(tables.keys())
except:
    pass

In [52]:
#for cities in df_cities['city']:
#    print(cities)

In [53]:
len(df_cities['city'])

13534